# DeletedRequestedWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..DeletedRequestedWarn Property
BuiltInFailures..::..EditingFailures Class See Also
---
You have deleted elements that other users requested.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeletedRequestedWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeletedRequestedWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeletedRequestedWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace